---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.BoundaryDirectionRotX
source: html/616f3573-2bc5-5138-d68d-a62de10a265c.htm
---
# Autodesk.Revit.DB.ParameterTypeId.BoundaryDirectionRotX Property

"X Rotation"

## Syntax (C#)
```csharp
public static ForgeTypeId BoundaryDirectionRotX { get; }
```